* problem statement
What is the 10001st prime number?

* solution
#+begin_src python :results output
  found_primes = [2]
  def is_divisible(num, divisor):
      return num % divisor == 0

  def is_prime(num):
      for prime in found_primes:
          if is_divisible(num, prime):
              return False

      return True

  next_number = 3
  while len(found_primes) < 10001:
      if is_prime(next_number):
          found_primes.append(next_number)

      next_number += 1

  print(found_primes[10000])
#+end_src

#+RESULTS:
: 104743
